import profileImage from '@/assets/profile.png'

export type AboutSection = {
  id: string
  title: string
  content: string
}

export type AboutData = {
  name: string
  photo?: string // 프로필 사진 경로
  sections: AboutSection[]
}

export const aboutData: AboutData = {
  name: '이상준',
  photo: profileImage,
  sections: [
    {
      id: '1',
      title: '프로그래머 이상준입니다.',
      content:
        '게임과학고등학교라는 게임 개발 특성화고등학교를 졸업하여 고등학교 졸업과 동시에 게임 회사에 취업을 하였고, 지금까지 7년 9개월 정도의 Unity 모바일 개발 경력을 가지고 있습니다.',
    },
    {
      id: '2',
      title: '재밌는 게임을 만들고 싶습니다.',
      content:
        '요즘 게임들은 재밌다는 말보다 잘 만들었다는 말이 먼저 나오는 경우가 많다고 생각합니다. 화려한 그래픽으로 게임을 잘 만들었다는 느낌보다는 게임이 재밌다는 소리가 먼저 나오는 게임을 만들고 싶습니다. 작년에 데브시스터즈의 쿠키런 모험의 탑을 즐겨 했습니다. 쿠키런 모험의 탑을 처음 플레이했을 때 쿠키로 액션 게임을 만드는 게 상상이 안되었는데, 만들어진 게임을 해보니 너무 재미있었습니다. 재미를 느끼고 개발자의 시점으로 게임을 분석해 보니 모바일 환경에서의 조작감, 타격감 등이 굉장히 잘 만들어진 것을 느꼈습니다.',
    },
    {
      id: '3',
      title: '만드는 사람이 즐겨야 잘 만들 수 있다고 생각합니다.',
      content:
        '저는 RPG 게임을 좋아합니다. 개발하는 사람이 잘 알고 재밌어하는 장르의 게임을 개발을 해야 발생할 수 있는 문제점 등을 예측할 수도 있고, 포인트를 잘 살려야 하는 부분은 더 잘 살려 좋은 게임을 만들 수 있을 거라고 생각합니다.',
    },
    {
      id: '4',
      title: '매년 발전하고 있습니다.',
      content:
        '매년 한 해를 마무리할 때마다 새로운 것을 배우고 발전하는 것을 느낍니다. 작년에는 회사에서 프로파일링 및 자동화 업무를 많이 담당하여 최적화 및 자동화에 대하여 많이 공부하였고, 최적화로 2배 이상의 성능 개선 및 업무 자동화로 인한 업무 속도 개선을 하였습니다.',
    },
    {
      id: '5',
      title: '커뮤니케이션에 자신있습니다.',
      content:
        '과거에 프로젝트 매니저를 하며 개발을 해본 경험이 있고 팀을 리딩 한 경험들이 있어 커뮤니케이션에 자신이 있습니다. 사람들마다 생각하는 게 다르고 성향이 달라서 팀원들과 협업하여 같이 개발하는 데 있어 좋은 커뮤니케이션 능력은 필수라고 생각합니다.',
    },
    {
      id: '6',
      title: '다양한 경험을 통한 성장.',
      content:
        '여러 회사를 다녀서 다양한 사람들과 다양한 장르의 프로젝트들을 개발해 보았고, 여러 가지 상황에 대해 발생하는 문제점들의 경험을 많이 해봐서 프로젝트 설계 능력 및 라이브 서비스를 고려하여 개발하는 능력이나 이슈 대응 능력이 많이 상승하였습니다.',
    },
  ],
}
